[
  "What is the difference between concurrency and parallelism?",
  "How does a hash table handle collisions?",
  "What happens when you type a URL into a browser?",
  "What is a memory leak and how can it be prevented?",
  "What are the advantages of immutability in functional programming?",
  "Why is quicksort faster in practice than mergesort?",
  "What is a race condition and how do you avoid it?",
  "What does CAP theorem say about distributed systems?",
  "How do bloom filters work and what are their limitations?",
  "What are the trade-offs of using a linked list over an array?",
  "How does garbage collection work in high-level languages?",
  "What is tail call optimization and why is it important?",
  "What is the difference between a process and a thread?",
  "Why does DNS use UDP instead of TCP?",
  "What is the difference between stack and heap memory?",
  "How does a CPU pipeline improve performance?",
  "What are the pros and cons of using recursion vs iteration?",
  "What is the difference between cohesion and coupling?",
  "What is eventual consistency in distributed systems?",
  "Why are indexes important in databases and how are they implemented?",
  "How do operating systems schedule processes?",
  "What is virtual memory and how does it work?",
  "What is a deadlock and how can it be prevented?",
  "What is a semaphore and how is it different from a mutex?",
  "How does HTTPS ensure secure communication?",
  "What is a context switch and what does it cost?",
  "How does DNS resolution work?",
  "What is a system call and how does it work?",
  "What is a buffer overflow and how is it exploited?",
  "What is a closure in programming?",
  "What are the key differences between TCP and UDP?",
  "How do web servers handle multiple requests concurrently?",
  "What is lazy evaluation and where is it useful?",
  "What are memory barriers and why do they matter?",
  "What is the difference between synchronous and asynchronous code?",
  "How does a virtual machine (VM) work?",
  "What is the difference between interpreted and compiled languages?",
  "What is the significance of Big-O notation?",
  "How does a priority queue differ from a regular queue?",
  "What is a trie and how is it used?",
  "What are the benefits of using a message queue?",
  "What is the difference between authentication and authorization?",
  "What is a microservice and how does it compare to a monolith?",
  "How does caching improve performance?",
  "What is a RESTful API and what are its constraints?",
  "What is the difference between symmetric and asymmetric encryption?",
  "How do you prevent SQL injection attacks?",
  "What is a sandbox and why is it important for security?",
  "How does load balancing work?",
  "What is a container and how does it differ from a virtual machine?",
  "What is eventual consistency in NoSQL databases?",
  "What is a bloom filter good for in real-world systems?",
  "What is a consistent hash and why is it used in distributed systems?",
  "What is the difference between polling and interrupts?",
  "How do file systems store and retrieve data?",
  "What is inode in a file system?",
  "How do CDNs improve website performance?",
  "What is the difference between deep and shallow copy?",
  "How do hash functions ensure data integrity?",
  "What are the pros and cons of using JSON over XML?",
  "What is a fork in Unix systems?",
  "What is the difference between a binary tree and a B-tree?",
  "How does Git's internals manage changes efficiently?",
  "What is the difference between HTTPS and SSH?",
  "What is the difference between reactivity and observability?",
  "What are the characteristics of a good hashing function?",
  "How does TCP's three-way handshake work?",
  "What is the N+1 query problem and how do you prevent it?",
  "What is the difference between MVC and MVVM?",
  "How do reactive frameworks like React handle re-renders?",
  "What is throttling vs debouncing?",
  "What is an event loop and how does it work in JavaScript?",
  "What are the differences between heap and stack allocation?",
  "What is a memory-mapped file?",
  "How does a compiler optimize code?",
  "What are intermediate representations in a compiler?",
  "What is a type system and how does it affect programming?",
  "How does static analysis work?",
  "What are the trade-offs of using dynamic vs static typing?",
  "How does DNS caching work?",
  "What is a race hazard in digital circuits?",
  "How does OAuth 2.0 work?",
  "What is the role of a load balancer in high-availability systems?",
  "How do you secure an API?",
  "What is an idempotent request in REST?",
  "What is speculative execution in modern CPUs?",
  "How do distributed databases maintain consistency?",
  "What is sharding and how is it implemented?",
  "How does a bloom filter help reduce database queries?",
  "What is a conflict-free replicated data type (CRDT)?",
  "How do you implement undo/redo functionality?",
  "What is a debounce function and when should you use one?",
  "What is zero-copy in networking?",
  "What is the importance of entropy in cryptography?",
  "How do you design a rate limiter?",
  "What’s the difference between a DSL and a general-purpose language?",
  "What is an LRU cache and how is it implemented?",
  "How does a reverse proxy differ from a forward proxy?",
  "What is exponential backoff and why is it used?",
  "How does a distributed lock work?",
  "What is a monad in functional programming?",
  "What is the purpose of a service mesh?",
  "How do pub/sub systems scale?",
  "How is vectorization used in performance optimization?"
]
